package javaStudy;

public class Instance {
	
	// 인스턴스를 만드는 3가지 방법
	// 1. new 연산자와 생성자를 이용하여 인스턴스를 만드는 방법
	// 2. 클래스 로더를 이용하는 방법(스프링 프레임워크 사용 시)
	// 3. 메모리에 있는 인스턴스를 복제(clone) 하여 만드는 방법
	
	// new 연산자를 사용하면 메모리에 인스턴스가 생성
	
	// new를 굉장히 많이 사용하면 메모리에 인스턴스가 많아지고 메모리가 부족해서 프로그램이 죽을 수도 있다.
	// 메모리 관리를 잘 해야 한다.
	
	// 인스턴스, 레퍼런스 타입, 레퍼런스 변수 구별하기
	
	// 인스턴스를 필요한 개수만큼 만드는 것이 중요
	
	// 인스턴스를 만들 때마다 메모리에 인스턴스가 생성
	
	// 객체 지향 프로그램에서 인스턴스 생성은 굉장히 중요
	
	// 클래스 작성하는 패턴을 정리한 것이 디자인 패턴
	
	// 객체 지향 프로그래밍 : 클래스를 사용하는게 아니라, 클래스의 인스턴스를 만든 후 사용하는 것
	// 따라서 클래스 지향이 아니라 객체 지향
}
